# Pandas 基础

## Pandas数据结构介绍
### Series DataFrame 两个主要的数据结构

In [16]:
import pandas as pd
import numpy as np

### Series 一维数组对象

In [2]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values # 数组表示形式

array([ 4,  7, -5,  3], dtype=int64)

In [4]:
obj.index # 索引对象

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [12]:
# 数组运算
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2) # 指数$e^x$

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
'b' in obj2

True

In [20]:
'e' in obj2

False

In [27]:
# 通过字典创建Series
sdata = {
    'Ohio' : 35000,
    'Texas' : 71000,
    'Oregon' : 160000,
    'Utah' : 5000
}
obj3 = pd.Series(sdata)
obj3 # 索引为原字典的key

Ohio       35000
Oregon    160000
Texas      71000
Utah        5000
dtype: int64

In [30]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

obj4 = pd.Series(sdata, index=states)
obj4  # 会找出 匹配的 index

California         NaN
Ohio           35000.0
Oregon        160000.0
Texas          71000.0
dtype: float64

In [31]:
obj4.isnull() # 找出是NaN值的

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [33]:
obj4.notnull() # 找出不是NaN

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [34]:
obj3 + obj4 # 算术运算中自动对其

California         NaN
Ohio           70000.0
Oregon        320000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [36]:
obj4.name = 'poplulation' # 设置数组的name属性
obj4.index.name = 'states' # 设置数组 行 name属性
obj4

states
California         NaN
Ohio           35000.0
Oregon        160000.0
Texas          71000.0
Name: poplulation, dtype: float64

In [38]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [39]:
obj.index = ['Bob', 'Steve', 'Jeff', 'RRR'] # Series数组索引修改
obj

Bob      4
Steve    7
Jeff    -5
RRR      3
dtype: int64

## DataFrame
### 表格型的数据结构 含有一组有序的列 每列可以使不同的值类型
### 既有行索引 又有列索引

In [41]:
data = {
    'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
    'year' : [2000, 2001, 2002, 2001, 2001],
    'pop' : [1.5, 1.7, 3.6, 2.4, 2.9]
}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2001

In [42]:
# 指定列序列
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2001  Nevada  2.9

In [44]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN

In [45]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2001
Name: year, dtype: int64

In [46]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2001
Name: year, dtype: int64

In [50]:
frame2.ix['one']

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [55]:
frame2.debt = 16.5 # dataframe 赋值
frame2['debt']

one      16.5
two      16.5
three    16.5
four     16.5
five     16.5
Name: debt, dtype: float64

In [58]:
frame2['debt'] = np.arange(5)
frame2['debt']

one      0
two      1
three    2
four     3
five     4
Name: debt, dtype: int32

In [59]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2001  Nevada  2.9  -1.7

In [67]:
frame2['eastern'] = frame2.state == 'Ohio' # pool 创建新列
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2001  Nevada  2.9  -1.7    False

In [68]:
del frame2['eastern'] # 删除列
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2001  Nevada  2.9  -1.7

In [69]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [70]:
# 另一种常见的数据形式 嵌套字典
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
      'Ohio' : {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop) # 字典内层的键会合并 成为行索引
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [71]:
frame3.T # 转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [72]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [91]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [93]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [94]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [95]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2001, 'Nevada', 2.9, -1.7]], dtype=object)

### 索引对象

In [97]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int32

In [98]:
index = obj.index

In [106]:
index[1:]

Index(['b', 'c'], dtype='object')

In [108]:
index[1] = 'd' # 索引对象无法修改

TypeError: Index does not support mutable operations

In [110]:
index = pd.Index(np.arange(3)) # 索引不可改变 因此需要设置好
obj2 = pd.Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [111]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [112]:
'Ohio' in frame3.columns

True

In [113]:
2003 in frame3.index

False

In [114]:
# index方法与属性
# append              连接另一个index对象 产生一个新的index
# diff                计算差集 并得到一个index
# intersection        计算交集
# union               计算并集
# isin                计算一个指示各值是否都包含在参数集合中的pool型数组
# delete              删除索引i处的元素 并得到新的index
# drop                删除传入的值 并得到新的index
# insert              将元素插入索引i处 并得到新的index
# is_monotonic        当各元素均大于前一个元素时 返回true
# is_unique           当index没有重复值时 返回True
# unique              计算index中唯一的数组

## 基本功能

### 重新索引 reindex

In [117]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [119]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [120]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [123]:
obj3 = pd.Series(['blue', 'purple', 'yello'], index=[0, 2, 4])
obj3

0      blue
2    purple
4     yello
dtype: object

In [136]:
obj3.reindex(np.arange(6), method='pad') # remind 插值 method

0      blue
1      blue
2    purple
3    purple
4     yello
5     yello
dtype: object

In [137]:
# reindex的插值method选项
# ffill或pad             前向充填
# bfill或backfill        后向充填

#### 对于DataFrame reindex可以修改行 列索引

In [141]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3),
                     index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])

In [142]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [143]:
frame.reindex(index=['a', 'b', 'c', 'd'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [144]:
frame.reindex(columns=['Texas', 'Utah', 'California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [147]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [150]:
# 同时对行列 重新索引
frame3=frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill').reindex(columns=['Texas', 'Utah', 'California'])
frame3 # pandas 版本问题

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [152]:
# 利用标签索引
states = ['Texas', 'Utah', 'California']
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [157]:
# reindex函数的参数
# method              插值（填充）方式 需要引入缺失值是使用的替代值
# fill_value          在重新索引的过程中 需要引入缺失值时使用的替代值
# limit               向前或向后填充时的最大填充量
# level               在Multiindex的指定级别上匹配简单索引 否则选取其子集
# copy                默认为True 无论如何都复制  如果为False 则新旧相等就不复制

### 丢弃指定轴上的项

#### drop

In [154]:
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])

In [155]:
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [156]:
obj.drop('c')

a    0
b    1
d    3
e    4
dtype: int32

In [158]:
obj.drop(['a', 'e'])

b    1
c    2
d    3
dtype: int32

In [159]:
# 对于DataFrame 可以删除任意轴上的索引值
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [161]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [162]:
data.drop(['Colorado', 'Ohio']) # 删除行

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [163]:
# 删除列
data.drop(['one', 'two'], axis=1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

### 索引 选取和过滤

In [164]:
obj = pd.Series(np.arange(4), index=['a', 'b', 'c', 'd'])

In [165]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [166]:
obj['b']

1

In [167]:
obj[1]

1

In [168]:
obj[2:4]

c    2
d    3
dtype: int32

In [169]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: int32

In [170]:
obj[[1, 3]]

b    1
d    3
dtype: int32

In [171]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [172]:
obj['b':'c']

b    1
c    2
dtype: int32

In [174]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: int32

In [175]:
# 对DataFrame进行索引其实就是获取一个或多个列
data = pd.DataFrame(np.arange(16).reshape((4, 4)), 
                    index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [176]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [177]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [178]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [179]:
# 索引的几个特殊情况 切片或布尔型数组
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [182]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [183]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [186]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [189]:
# 对于dataframe 为了能够在行上进行标签索引 引入了ix
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [190]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [191]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [192]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [193]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [194]:
# .ix['index', 'columns']
# .ix[['index1', 'index2'], ['columns1', 'columns2']]
# .ix[int(index)]
# .ix[:indexslice, 'columns']
# .ix[data.columns > n, :indexslice]

### 算术运算和数据对齐

#### pandas中的一个重要功能是对不同索引的对象进行算术运算 再将对象相加时 如果存在不同的索引对 则结果的索引就是该索引对的并集

In [196]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [197]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [198]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [199]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [201]:
# 对于dataframe，对齐操作同时会发生在行和列上
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=list('bcd'), 
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12).reshape((4, 3)),
                   columns=list('bde'), 
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [202]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [203]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [204]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### 在算术方法中填充值

In [225]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), columns=list('abcde'))

In [226]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [227]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [228]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [229]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [230]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [231]:
# 灵活的算术方法
# add                   用于加法的方法
# sub                   用于减法的方法
# div                   用于除法的方法
# mul                   用于乘法的方法

### DataFrame与Series之间的运算

In [233]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [234]:
arr[0]

array([0, 1, 2, 3])

In [241]:
arr - arr[0] # 广播

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [242]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Teaxs', 'Oregon'])

In [244]:
series = frame.ix[0]

In [245]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Teaxs   6   7   8
Oregon  9  10  11

In [246]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [247]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Teaxs   6  6  6
Oregon  9  9  9

In [248]:
# 如果某个索引值在DataFrame的列或Series的索引中找不到， 则参与预算的两个对象就会重新被索引以形成并集
series2 = pd.Series(range(3), index=['b', 'e',' f'])

In [249]:
series2

b     0
e     1
 f    2
dtype: int32

In [250]:
frame + series2

         f    b   d     e
Utah   NaN  0.0 NaN   3.0
Ohio   NaN  3.0 NaN   6.0
Teaxs  NaN  6.0 NaN   9.0
Oregon NaN  9.0 NaN  12.0

In [251]:
series3 = frame['d']

In [252]:
series3

Utah       1
Ohio       4
Teaxs      7
Oregon    10
Name: d, dtype: int32

In [259]:
frame.sub(series3, axis=0) # 设置axis 匹配行且在列上广播

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Teaxs  -1  0  1
Oregon -1  0  1

### 函数应用和映射

#### Numpy的ufuncs（元素级数组方法）也可用于操作pandas对象

In [260]:
frame = pd.DataFrame(np.random.rand(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [261]:
frame

               b         d         e
Utah    0.201744  0.235540  0.014706
Ohio    0.859637  0.374692  0.879725
Texas   0.402030  0.675441  0.899891
Oregon  0.864274  0.498107  0.970898

In [262]:
np.abs(frame)

               b         d         e
Utah    0.201744  0.235540  0.014706
Ohio    0.859637  0.374692  0.879725
Texas   0.402030  0.675441  0.899891
Oregon  0.864274  0.498107  0.970898

In [264]:
f = lambda x: x.max() - x.min()
    
frame.apply(f)

b    0.662530
d    0.439901
e    0.956193
dtype: float64

In [265]:
frame.apply(f, axis=1)

Utah      0.220835
Ohio      0.505033
Texas     0.497861
Oregon    0.472791
dtype: float64

In [268]:
# 编写函数 传递给apply
def f(x):
    return pd.Series([x.max(), x.min()], index=['max', 'min'])

frame.apply(f)

            b         d         e
max  0.864274  0.675441  0.970898
min  0.201744  0.235540  0.014706

### apply 和 applymap区别

#### apply将函数应用到列或行上 applymap将函数应用到每个数据上

In [269]:
format = lambda x: '%.2f' % x

frame.applymap(format)

           b     d     e
Utah    0.20  0.24  0.01
Ohio    0.86  0.37  0.88
Texas   0.40  0.68  0.90
Oregon  0.86  0.50  0.97

In [270]:
# 之所以叫applymap
frame['e'].map(format)

Utah      0.01
Ohio      0.88
Texas     0.90
Oregon    0.97
Name: e, dtype: object

### 排序和排名
#### 根据条件对数据集排序也是一种重要的内置运算
#### sort_index() 根据轴上的索引排序

In [272]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [273]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [275]:
# 对于DataFrame
frame = pd.DataFrame(np.arange(8).reshape(2, 4), index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [276]:
frame.sort_index() # 行索引排序

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [277]:
frame.sort_index(axis=1) # 列索引排序

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [278]:
frame.sort_index(axis=1, ascending=False) # 默认为升序 但也可以降序

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### 按值排序 Series order()  DataFrame rank() sort_index(by='') sort_value()

In [280]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [281]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [285]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [287]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

#### 排名  rank 为各组分配一个平均排名

In [289]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [290]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [291]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [292]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [297]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                     'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [299]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 带有重复值的轴索引

In [300]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [301]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [303]:
obj.index.is_unique

False

In [308]:
# 对DataFrame
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [309]:
df

          0         1         2
a  0.646968  0.614836  1.597356
a  0.189425 -1.678650  0.937741
b  1.444672 -0.209845  0.820941
b  0.204048 -0.223865  0.339111

In [310]:
df.index.is_unique

False

In [312]:
df.ix['a']

          0         1         2
a  0.646968  0.614836  1.597356
a  0.189425 -1.678650  0.937741

## 汇总和计算描述统计

In [315]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                   index=list('abcd'),
                   columns=['one', 'two'])

In [316]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [317]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [318]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [319]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [320]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [321]:
# 简约方法的选项
# axis         简约的轴 DataFrame的行用0 列用1
# skipna       排除缺失值 默认值为True
# level        如果轴是层次化索引的， 则根据level分组简约

In [324]:
df.idxmax() # 返回的是间接统计 达到最小值或最大值

one    b
two    d
dtype: object

In [325]:
df.idxmin()

one    d
two    b
dtype: object

In [327]:
df.cumsum()  # 累计型

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [329]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

### 描述和统计汇总

In [330]:
# count          非NA值得数量
# describe       针对Series或DataFrame列计算汇总统计
# min max        计算最小值 最大值
# argmin argmax  计算能够获取到最小值和最大值的索引位置
# idxmax idxmin  计算能够获取到最小值和最大值的索引值
# quantile       计算样本的分位数
# sum            值的总和
# mean           值的平均数
# mad            根据平均值计算平均绝对离差
# var            样本值的方差
# std            样本值的标准差
# skew           样本值的偏度
# kurt           样本值的峰度
# cumsum         样本值的累计和
# cummin cummax  样本值的累计最大值和累计最小值
# cumprod        样本值的累计积
# pct_change     计算百分数变化

### 相关系数与协方差

In [337]:
from pandas_datareader import data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data['ticker'] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

In [356]:
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
price.tail()
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})
volume.tail()

                 AAPL       GOOG      IBM      MSFT
Date
2009-12-24  125222300  1728500.0  4265100  11083900
2009-12-28  161141400  3417800.0  5800400  25384000
2009-12-29  111301400  2868100.0  4184200  29716200
2009-12-30  103021100  2950200.0  3867000  42006200
2009-12-31   88102700  2455400.0  4223400  31929700

In [357]:
# 计算价格的百分比
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034340  0.011117  0.004384  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003476  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [358]:
# Series的corr方法用于计算两个Series中重叠的 非NA的 按索引对齐的值的相关系数
returns.MSFT.corr(returns.IBM) # 相关系数

0.49435864405078667

In [359]:
returns.MSFT.cov(returns.IBM) # 协方差

0.00021582144509535464

In [360]:
# DataFrame的corr和cov方法 以DataFrame的形式返回完整的相关系数或协方差矩阵
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.412392  0.423598
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.412392  0.390689  1.000000  0.494359
MSFT  0.423598  0.443587  0.494359  1.000000

In [361]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001030  0.000303  0.000254  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000254  0.000142  0.000369  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [362]:
returns.corrwith(returns.IBM)

AAPL    0.412392
GOOG    0.390689
IBM     1.000000
MSFT    0.494359
dtype: float64

In [363]:
returns.corrwith(volume)

AAPL   -0.057665
GOOG    0.062647
IBM    -0.006592
MSFT   -0.014228
dtype: float64

### 唯一值 值计数 以及成员资格

In [364]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [366]:
obj.unique() # 唯一值

array(['c', 'a', 'd', 'b'], dtype=object)

In [367]:
obj.value_counts() # 值计数

a    3
c    3
b    2
d    1
dtype: int64

In [369]:
pd.value_counts(obj.values, sort=False)

c    3
d    1
a    3
b    2
dtype: int64

In [371]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [372]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [374]:
# DataFrame 只能通过apply传递生效
data = pd.DataFrame({'Qu1' : [1, 3, 4, 3, 4],
                     'Qu2' : [2, 3, 1, 2, 3],
                     'Qu3' : [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [377]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 处理缺失数据

In [378]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [381]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [382]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [384]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [385]:
# NA处理方法
# dropna     根据各标签的值中是否存在缺失数据对轴标签进行过滤 可通过阈值调节对缺失值的容忍度
# fillna     用指定值或插值方法 填充确实数据
# isnull     返回一个含有pool值的对象 
# notnull    isnull的否定式

### 滤除缺失数据

In [386]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [388]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [391]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [393]:
data = pd.DataFrame([[1, 6.5, 3], [1, np.nan, np.nan],
                    [np.nan, np.nan, np.nan], [np.nan, 6.5, 3]])

In [394]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [395]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [396]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [398]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [399]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [404]:
df = pd.DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = np.nan
df.loc[:2, 2] = np.nan
df

          0         1         2
0  1.244349       NaN       NaN
1 -1.889025       NaN       NaN
2 -1.910528       NaN       NaN
3  0.375530       NaN -0.074101
4  0.622314       NaN  0.223940
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

In [409]:
df.dropna(thresh=3) # thresh 参数 Keep only the rows with at least 3 non-na values:

          0         1         2
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

### 填充缺失数据

In [410]:
df

          0         1         2
0  1.244349       NaN       NaN
1 -1.889025       NaN       NaN
2 -1.910528       NaN       NaN
3  0.375530       NaN -0.074101
4  0.622314       NaN  0.223940
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

In [411]:
df.fillna(0)

          0         1         2
0  1.244349  0.000000  0.000000
1 -1.889025  0.000000  0.000000
2 -1.910528  0.000000  0.000000
3  0.375530  0.000000 -0.074101
4  0.622314  0.000000  0.223940
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

In [412]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  1.244349  0.500000       NaN
1 -1.889025  0.500000       NaN
2 -1.910528  0.500000       NaN
3  0.375530  0.500000 -0.074101
4  0.622314  0.500000  0.223940
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

In [414]:
# fillna 默认返回新对象 但也可以对现有对象进行修改
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.244349  0.000000  0.000000
1 -1.889025  0.000000  0.000000
2 -1.910528  0.000000  0.000000
3  0.375530  0.000000 -0.074101
4  0.622314  0.000000  0.223940
5  0.978771  1.002563  0.285764
6 -1.274071 -0.784550 -0.334351

In [415]:
# fillna()同样具有插值方法 method
df = pd.DataFrame(np.random.randn(6, 3))

In [421]:
df.loc[2:, 1] = np.nan
df.loc[4:, 2] = np.nan
df

          0         1         2
0 -1.503832  0.126996 -0.463224
1  0.261306  0.958589 -1.232972
2 -0.855985       NaN  2.281567
3  0.219858       NaN -0.767382
4  0.105074       NaN       NaN
5 -0.099332       NaN       NaN

In [422]:
df.fillna(method='ffill')

          0         1         2
0 -1.503832  0.126996 -0.463224
1  0.261306  0.958589 -1.232972
2 -0.855985  0.958589  2.281567
3  0.219858  0.958589 -0.767382
4  0.105074  0.958589 -0.767382
5 -0.099332  0.958589 -0.767382

In [423]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.503832  0.126996 -0.463224
1  0.261306  0.958589 -1.232972
2 -0.855985  0.958589  2.281567
3  0.219858  0.958589 -0.767382
4  0.105074       NaN -0.767382
5 -0.099332       NaN -0.767382

## 层次化索引
### 在一个轴上拥有多个索引级别 以低纬度形式处理高纬度数据

In [424]:
data = pd.Series(np.random.randn(10),
                 index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.830015
   2   -0.274048
   3    1.934984
b  1   -1.055416
   2    1.265147
   3    0.155353
c  1    0.095024
   2   -1.012473
d  2    0.115078
   3   -1.388156
dtype: float64

In [425]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [427]:
data['b']

1   -1.055416
2    1.265147
3    0.155353
dtype: float64

In [428]:
data['b' : 'c']

b  1   -1.055416
   2    1.265147
   3    0.155353
c  1    0.095024
   2   -1.012473
dtype: float64

In [429]:
data.loc[['b', 'd']]

b  1   -1.055416
   2    1.265147
   3    0.155353
d  2    0.115078
   3   -1.388156
dtype: float64

In [432]:
data[:, 2] # 内层中进行选取

a   -0.274048
b    1.265147
c   -1.012473
d    0.115078
dtype: float64

### 层次化索引在数据重塑和基于分组的操作（如透视表生成）中扮演者重要角色 例如unstack

In [434]:
data.unstack()

          1         2         3
a -0.830015 -0.274048  1.934984
b -1.055416  1.265147  0.155353
c  0.095024 -1.012473       NaN
d       NaN  0.115078 -1.388156

In [435]:
data.unstack().stack()

a  1   -0.830015
   2   -0.274048
   3    1.934984
b  1   -1.055416
   2    1.265147
   3    0.155353
c  1    0.095024
   2   -1.012473
d  2    0.115078
   3   -1.388156
dtype: float64

#### 对于DataFrame 每条轴都可以有分层索引

In [436]:
frame = pd.DataFrame(np.arange(12).reshape((4 ,3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])

In [437]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [454]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [455]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 重排分级排序

In [457]:
# swaplevel接受两个级别编号或名称 并返回一个互换级别的新对象
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [464]:
# sortlevel
frame.sortlevel(1)

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [465]:
frame.swaplevel(0, 1).sortlevel(0)

C:\Users\Administrator\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 根据级别汇总统计

In [466]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [467]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [468]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 使用DataFrame的列

In [469]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})

In [470]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [471]:
frame2 = frame.set_index(['c', 'd']) # 将一个或多个列转化为行索引

In [472]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [474]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [475]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1